
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |       38 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                           |
|:--------:|:----------------------------------------------------------------------------------------------------|
|    🟢    | `module.repos["terraform-aws-actions-runner"].github_repository_file.renovate-json[0]`              |
|    🟢    | `module.repos["terraform-aws-aerospike"].github_repository_file.renovate-json[0]`                   |
|    🟢    | `module.repos["terraform-aws-bookstack"].github_repository_file.renovate-json[0]`                   |
|    🟢    | `module.repos["terraform-aws-ci-cd"].github_repository_file.renovate-json[0]`                       |
|    🟢    | `module.repos["terraform-aws-cloud-init"].github_repository_file.renovate-json[0]`                  |
|    🟢    | `module.repos["terraform-aws-cloudcraft-role"].github_repository_file.renovate-json[0]`             |
|    🟢    | `module.repos["terraform-aws-cost-alert"].github_repository_file.renovate-json[0]`                  |
|    🟢    | `module.repos["terraform-aws-debian-repo"].github_repository_file.renovate-json[0]`                 |
|    🟢    | `module.repos["terraform-aws-dms"].github_repository_file.renovate-json[0]`                         |
|    🟢    | `module.repos["terraform-aws-ecr"].github_repository_file.renovate-json[0]`                         |
|    🟢    | `module.repos["terraform-aws-ecs"].github_repository_file.renovate-json[0]`                         |
|    🟢    | `module.repos["terraform-aws-elasticsearch"].github_repository_file.renovate-json[0]`               |
|    🟢    | `module.repos["terraform-aws-gh-identity-provider"].github_repository_file.renovate-json[0]`        |
|    🟢    | `module.repos["terraform-aws-gha-admin"].github_repository_file.renovate-json[0]`                   |
|    🟢    | `module.repos["terraform-aws-github-backup"].github_repository_file.renovate-json[0]`               |
|    🟢    | `module.repos["terraform-aws-github-backup-configuration"].github_repository_file.renovate-json[0]` |
|    🟢    | `module.repos["terraform-aws-github-role"].github_repository_file.renovate-json[0]`                 |
|    🟢    | `module.repos["terraform-aws-guardduty-configuration"].github_repository_file.renovate-json[0]`     |
|    🟢    | `module.repos["terraform-aws-instance-profile"].github_repository_file.renovate-json[0]`            |
|    🟢    | `module.repos["terraform-aws-iso27001"].github_repository_file.renovate-json[0]`                    |
|    🟢    | `module.repos["terraform-aws-jumphost"].github_repository_file.renovate-json[0]`                    |
|    🟢    | `module.repos["terraform-aws-kibana"].github_repository_file.renovate-json[0]`                      |
|    🟢    | `module.repos["terraform-aws-openvpn"].github_repository_file.renovate-json[0]`                     |
|    🟢    | `module.repos["terraform-aws-postfix"].github_repository_file.renovate-json[0]`                     |
|    🟢    | `module.repos["terraform-aws-pypiserver"].github_repository_file.renovate-json[0]`                  |
|    🟢    | `module.repos["terraform-aws-secret"].github_repository_file.renovate-json[0]`                      |
|    🟢    | `module.repos["terraform-aws-secret-policy"].github_repository_file.renovate-json[0]`               |
|    🟢    | `module.repos["terraform-aws-service-network"].github_repository_file.renovate-json[0]`             |
|    🟢    | `module.repos["terraform-aws-sqs-pod"].github_repository_file.renovate-json[0]`                     |
|    🟢    | `module.repos["terraform-aws-state-bucket"].github_repository_file.renovate-json[0]`                |
|    🟢    | `module.repos["terraform-aws-state-manager"].github_repository_file.renovate-json[0]`               |
|    🟢    | `module.repos["terraform-aws-tags-override"].github_repository_file.renovate-json[0]`               |
|    🟢    | `module.repos["terraform-aws-tcp-pod"].github_repository_file.renovate-json[0]`                     |
|    🟢    | `module.repos["terraform-aws-teleport"].github_repository_file.renovate-json[0]`                    |
|    🟢    | `module.repos["terraform-aws-terraformer"].github_repository_file.renovate-json[0]`                 |
|    🟢    | `module.repos["terraform-aws-truststore"].github_repository_file.renovate-json[0]`                  |
|    🟢    | `module.repos["terraform-aws-update-dns"].github_repository_file.renovate-json[0]`                  |
|    🟢    | `module.repos["terraform-aws-website-pod"].github_repository_file.renovate-json[0]`                 |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repos["terraform-aws-actions-runner"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-actions-runner"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-aerospike"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-aerospike"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-bookstack"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-bookstack"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-ci-cd"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-ci-cd"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-cloud-init"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-cloud-init"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-cloudcraft-role"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-cloudcraft-role"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-cost-alert"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-cost-alert"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-debian-repo"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-debian-repo"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-dms"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-dms"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-ecr"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-ecr"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-ecs"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-ecs"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-elasticsearch"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-elasticsearch"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-gh-identity-provider"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-gh-identity-provider"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-gha-admin"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-gha-admin"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-github-backup"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-github-backup"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-github-backup-configuration"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-github-backup-configuration"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-github-role"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-github-role"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-guardduty-configuration"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-guardduty-configuration"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-instance-profile"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-instance-profile"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-iso27001"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-iso27001"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-jumphost"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-jumphost"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-kibana"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-kibana"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-openvpn"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-openvpn"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-postfix"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-postfix"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-pypiserver"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-pypiserver"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-secret"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-secret"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-secret-policy"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-secret-policy"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-service-network"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-service-network"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-sqs-pod"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-sqs-pod"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-state-bucket"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-state-bucket"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-state-manager"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-state-manager"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-tags-override"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-tags-override"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-tcp-pod"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-tcp-pod"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-teleport"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-teleport"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-terraformer"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-terraformer"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-truststore"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-truststore"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-update-dns"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-update-dns"
      + sha                 = (known after apply)
    }

  # module.repos["terraform-aws-website-pod"].github_repository_file.renovate-json[0] will be created
  + resource "github_repository_file" "renovate-json" {
      + commit_message      = "Configure renovate"
      + commit_sha          = (known after apply)
      + content             = jsonencode(
            {
              + "$schema"         = "https://docs.renovatebot.com/renovate-schema.json"
              + extends           = [
                  + "config:recommended",
                ]
              + prConcurrentLimit = 1
            }
        )
      + file                = "renovate.json"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + ref                 = (known after apply)
      + repository          = "terraform-aws-website-pod"
      + sha                 = (known after apply)
    }

Plan: 38 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAiYWRkIjogMzgsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==
```
</details>